In [1]:
import pandas as pd

In [2]:
df_A = pd.DataFrame([
    {"Nombre":"Mario","Perfil":"Electromecanico"},
    {"Nombre":"Sandra","Perfil":"Quimia"},
    {"Nombre":"Laura","Perfil":"Informatica"},
    {"Nombre":"Elsy","Perfil":"Quimica"}
])
df_A = df_A.set_index("Nombre")
df_A

                 Perfil
Nombre
Mario   Electromecanico
Sandra           Quimia
Laura       Informatica
Elsy            Quimica

In [3]:
df_B = pd.DataFrame([
    {"Nombre":"Mario","Puesto":"Director"},
    {"Nombre":"Sandra","Puesto":"Supervisor"},
    {"Nombre":"Arturo","Puesto":"inspecto"},
    {"Nombre":"Laura","Puesto":"Director"}
])
df_B = df_B.set_index("Nombre")
df_B

            Puesto
Nombre
Mario     Director
Sandra  Supervisor
Arturo    inspecto
Laura     Director

In [4]:
print(df_A)
print(df_B)

                 Perfil
Nombre
Mario   Electromecanico
Sandra           Quimia
Laura       Informatica
Elsy            Quimica
            Puesto
Nombre
Mario     Director
Sandra  Supervisor
Arturo    inspecto
Laura     Director

In [5]:
## Marge Inner 
pd.merge(df_A,df_B,how="inner", 
         left_index=True,
         right_index=True)

                 Perfil      Puesto
Nombre
Mario   Electromecanico    Director
Sandra           Quimia  Supervisor
Laura       Informatica    Director

## Merge outer

In [ ]:
## Marge Inner 
pd.merge(df_A,df_B,how="outer", 
         left_index=True,
         right_index=True)

                 Perfil      Puesto
Nombre
Arturo              NaN    inspecto
Elsy            Quimica         NaN
Laura       Informatica    Director
Mario   Electromecanico    Director
Sandra           Quimia  Supervisor

## Marge right

In [ ]:
## Marge Inner 
pd.merge(df_A,df_B,how="right", 
         left_index=True,
         right_index=True)

                 Perfil      Puesto
Nombre
Mario   Electromecanico    Director
Sandra           Quimia  Supervisor
Arturo              NaN    inspecto
Laura       Informatica    Director

In [ ]:
## Marge left
pd.merge(df_A,df_B,how="left", 
         left_index=True,
         right_index=True)

                 Perfil      Puesto
Nombre
Mario   Electromecanico    Director
Sandra           Quimia  Supervisor
Laura       Informatica    Director
Elsy            Quimica         NaN

In [11]:
df=pd.read_csv("Python Tiburcio/datosx.csv")
df

,nc,nombre,carrera,cooperacion,sexo,procedencia,Edad,Peso,Estatura
0,18090907,Angel Axel Cuaxilo Rodirguez,ISC,100.0,Masculino,Amacuzac,21.0,80.00,1.75
1,17091058,Everest Daniel Gutierrez Andrade,ISC,100.0,Masculino,Ocuituco,21.0,78.00,1.70
2,18091045,Aurora de Jesus Linares Jacobo,ISC,100.0,Femenino,Temixco,22.0,65.00,1.65
3,18091054,Mario Martinez Arteaga,ISC,NaN,Masculino,Amacuzac,21.0,78.00,1.65
4,18091065,Yeel Montes Camacho,ISC,50.0,Masculino,Zacatepec,22.0,76.00,1.72
5,19090356,Georgina Itzel Alvarez,ISC,150.0,Femenino,Jojutla,21.0,75.00,1.60
6,19090333,Britney Spears,ADM,80.0,Femenino,HollyWood,NaN,1.64,NaN
7,18090233,Adrian Flores Herreram,ISC,100.0,Masculino,Zacatepec,22.0,78.00,1.69
8,18091049,Miriam Luna Aparicio,ISC,100.0,Femenino,Cuetzala,21.0,75.00,1.59
9,18090961,Salvador Jesus Barbina Cabrera,ISC,100.0,Masculino,Cuernavaca,22.0,78.00,1.71
10,21091037,Hernán Cortés,QUIM,100.0,Masculino,Cuernavaca,45.0,80.00,1.81
11,22090333,Juana de Arco,ADM,150.0,Femenino,Guanajuato,39.0,60.00,1.63
12,22090555,Bruce Wayne,QUIM,150.0,Masculino,Cd. Gótica,47.0,90.00,1.90

In [13]:
print("Hola")

Hola

In [1]:
print("Hola Pc 2")

Hola Pc 2

In [ ]:
print("no se ve nada")

In [ ]:
#ggggggggggggggggggggggggggggggggggggggggggggggggggggggggggg